// $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
// $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
// 定义倒计时
$(document).ready(function(){

    // 设置需要倒计时的秒数
    var t = 10;

    function Daojishi(){
        document.getElementById('JumpTime').innerHTML = t ;

        // 判断是否完成倒计时
        if(t == 0){
            // 返回前三页
            window.history.go(-1);
        }
        else{
            t-=1;
        }

        // 设置以后每个 1 秒执行脚本一次
        setTimeout(Daojishi, 1000);
        
    }

    // 首次调用启动
    Daojishi(); 
    
});

// $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
// $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
// $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$

// 定义注册成功倒计时
$(document).ready(function(){

    // 设置需要倒计时的秒数
    var t = 20;

    function Daojishi(){
        document.getElementById('JumpTime_RegSuccess').innerHTML = t ;

        // 判断是否完成倒计时
        if(t == 0){
            // 返回前三页
            window.history.go(-3);
        }
        else{
            t-=1;
        }

        // 设置以后每个 1 秒执行脚本一次
        setTimeout(Daojishi, 1000);
        
    }

    // 首次调用启动
    Daojishi(); 
    
});



